Repository: canonical/checkbox
Catalog: checkbox-ng/plainbox/impl/providers/exporters/po/*.po
Languages: pl, zh_tw

source: Generate XML (for certification)
pl: Wygeneruj XML (dla certifikacji)
zh_tw: 輸出 XML (認證用)

source: Generate a standalone HTML
pl: Wygeneruj samodzielny HTML
zh_tw: 輸出獨立的 HTML 格式檔

source: Generate JSON output
pl: Wygeneruj wydruk JSON
zh_tw: 輸出 JSON 格式檔

source: Generate RCF822 output
pl: Wygeneruj wydruk RCF822
zh_tw: 輸出 RCF822 格式檔

source: Generate plain text output
pl: Wygeneruj wydruk tekstu jawnego
zh_tw: 輸出純文字格式檔

source: Generate a tar.gz archive
pl: Wygeneruj archiwum tar.gz
zh_tw: 輸出 tar.gz 壓縮檔

source: Generate an Excel 2007+ XLSX document
pl: Wygeneruj dokument w formacie Excela 2007+ XLSX
zh_tw: 輸出 Excel 2007+ XLSX 文件格式檔

source: Exporters Provider
pl: Dostawca eksporterów
zh_tw: 報表輸出器供應包

source: The Exporters provider is special
pl: Dostawca eksporterów jest specjalny
zh_tw: 這是一個特別的報表輸出器供應包

source: You don't need to develop it explicitly
pl: Nie trzeba go jawnie 'developować'
zh_tw: 您不需要直接對它進行開發

source: You don't need to install it explicitly
pl: Nie trzeba go jawnie instalować
zh_tw: 您不需要額外安裝它
