Repository: canonical/checkbox
Catalog: providers/resource/po/*.po
Languages: fr, ru

source: Collect information about the CPU
fr: Collecter des information à propos du processeur
ru: Сбор информации о процессоре

source: Gets CPU resource info from /proc/cpuinfo
fr: Récupère les informations relatives aux ressources utilisées par le processeur à partir de /proc/cpuinfo
ru: Получает данные ресурса CPU из /proc/cpuinfo

source: Collect information about installation media (casper)
fr: Collecter des informations à propos du support d'installation (casper)
ru: Сбор информации о установочном носителе (casper)

source: Gets installation info from casper.log and media-info
fr: Récupère les informations relatives à l'installation à partir de casper.log et de media-info
ru: Получает данные установки из casper.log и медиа-информации

source: Collect information about dpkg version
fr: Collecter des informations à propos de la version de dpkg
ru: Сбор информации о версии DPKG

source: Gets info on the version of dpkg installed
fr: Récupère les informations relatives à la version de dpkg installée
ru: Получает информацию о установленной версии DPKG

source: Generates resource info from gconf settings
fr: Génère les informations relatives aux ressources à partir des réglages de gconf
ru: Генерация информации от настроек Gconf

source: Collect information about software configuration (gconf)
fr: Collecter des informations à propos de la configuration des logiciels (gconf)
ru: Сбор информации о конфигурации программного обеспечения (GConf)

source: Generates release info based on /etc/lsb-release
fr: Génère les informations relatives à la version de sortie à partir de /etc/lsb-release
ru: Формирует релиз на основе информации из /etc/lsb-release

source: Collect information about installed system (lsb-release)
fr: Collecter des informations à propos du système installé (lsb-release)
ru: Сбор информации об установленной системе (LSB-release)

source: Generates resource info based on /proc/meminfo
fr: Génère les informations relatives aux ressources à partir de /proc/meminfo
ru: Формирует данные о /proc/meminfo

source: Collect information about system memory (/proc/meminfo)
fr: Collecter des informations à propos de la mémoire du système (/proc/meminfo)
ru: Сбор информации о системной памяти (/proc/meminfo)

source: Generates resources info on running kernel modules
fr: Génère les informations relatives aux ressources des modules exécutés par le noyau
ru: Формирует данные о запущенных модулях ядра

source: Collect information about kernel modules
fr: Collecter des informations à propos des modules du noyau
ru: Сбор информации о модулях ядра

source: Generates a list of packages
fr: Génère une liste de paquets
ru: Формирует список пакетов

source: Collect information about installed software packages
fr: Collecter des informations à propos des paquets de logiciels installés
ru: Сбор информации об установленных пакетах программного обеспечения

source: Enumerate available system executables
fr: Énumérer les exécutables du système disponibles
ru: Перечисление доступных системных исполняемых файлов

source: Generates a resource for all available executables
fr: Génère une ressource pour tous les exécutables disponibles
ru: Создает ресурс для всех доступных исполняемых файлов

source: Creates resource info from udev
fr: Crée des informations relatives aux ressources à partir d'udev
ru: Создает данные из Udev

source: Collect information about hardware devices (udev)
fr: Collecter des informations à propos des périphériques matériels (udev)
ru: Сбор информации об аппаратных устройствах (Udev)

source: Collect unfiltered udev data
fr: Collecte des données non filtrées à partir d'udev
ru: Сбор неотсортированных данных Udev

source: This job collects the udev database in mostly raw format. The only transformations applied are basic changes to make the format compatible with RFC822 syntax required by PlainBox.
fr: Cette tâche collecte la base de données d'udev majoritairement en format brut. Les seules transformations appliquées sont des changements basiques pour rendre le format compatible avec la syntaxe RFC822 requise par PlainBox.

source: Collect information about hardware devices (DMI)
fr: Collecter des informations à propos des périphériques matériels (DMI)
ru: Сбор информации об аппаратных устройствах (DMI)

source: Creates resource info from uname output
fr: Crée des informations relatives aux ressources à partir de la sortie d'uname

source: Collect information about the running kernel
fr: Collecter des informations à propos du noyau en cours d'exécution
ru: Сбор информации о запущенном ядре

source: Create resource info for supported sleep states
fr: Crée des informations relatives aux ressources pour les états de veille pris en charge
ru: Создание информации для поддерживаемых состояний сна

source: Create resource info for supported optical actions ({name})
fr: Générer les renseignements pour les actions optiques prises en charge ({name})
ru: Создание информации ресурса для поддерживаемых оптических действий ({name})

source: Create resource info for removable block devices
fr: Crée des informations relatives aux ressources pour les dispositifs amovibles
ru: Создание информации для съемных блочных устройств

source: Creates display resource info from xrandr output
fr: Crée des informations relatives aux ressources d'affichage à partir de la sortie de xrandr
ru: Создание информации о дисплеи из XRandR вывода

source: Creates resource info for supported USB versions
fr: Crée des informations relatives aux ressources pour les versions USB prises en charge
ru: Создает данные ресурса для поддерживаемых версий USB

source: Collect information about supported types of USB
fr: Collecter des informations à propos des types d'USB pris en charge
ru: Сбор информации о поддерживаемых типах USB

source: Creates resource info from xinput output.
fr: Crée des informations relatives aux ressources à partir de la sortie de xinput
ru: Создает данные из Xinput вывода.

source: Create resource info for environment variables
fr: Crée des informations relatives aux ressources pour les variables d'environnement
ru: Создание информации о переменных окружения

source: Create resource for mobile broadband devices
fr: Crée des ressources pour les appareils mobiles à haut débit
ru: Создаине информации о мобильных широкополосных устройств

source: Resource for hardware virtualization
fr: Ressources pour la virtualisation du matériel
ru: Ресурс для аппаратной виртуализации

source: Creates resource info for wifi supported protocols/interfaces
fr: Crée des informations relatives aux ressources pour les protocoles et les interfaces Wi-Fi pris en charge
ru: Создает данные поддерживаемых протоколов/интерфейсов для WiFi

source: Creates resource info for RTC
fr: Crée des informations relatives aux ressources pour RTC
ru: Создает данные для RTC

source: Provide links to requirements documents.
fr: Fournit des liens vers les documents relatifs aux exigences.
ru: Укажите ссылки на требования документов.

source: The requirement document should contain sets of name/link pairs.
fr: Le document d'exigences devrait contenir des séries de paires de nom/lien.
ru: В этом документе требование должно содержать наборы пар имя/ссылка.

source: Each requirement should have two keys with their respective values: name: (to be used as the anchor text) link: (the actual URL)
fr: Chaque exigence devrait avoir deux clés avec leurs valeurs respectives : nom : (à utiliser comme texte d'ancrage) lien : (l'URL en elle-même)
ru: Каждое требование должно иметь два ключа с соответствующими значениями: имя: (для использования в качестве якорного текста) ссылка: (фактический адрес)

source: Each set should be separated from the previous one by a new line.
fr: Chaque série devrait être séparée de la précédente par une nouvelle ligne.
ru: Каждый набор должен быть отделен от предыдущего новой линии.

source: Example:
fr: Exemple :
ru: Пример:

source: name: Requirement 1 link: http://example.com/requirement1
fr: nom : exigence 1 lien : http://exemple.com/exigence1

source: name: requirement 2 link: http://example.com/requirement2
fr: nom : exigence 2 lien : http://exemple.com/exigence2

source: Providers wishing to use this feature need to: 1- Write a job that places a suitably-formatted file in $PLAINBOX_SESSION_SHARE 2- Update their whitelists to run that job *before* miscellanea/submission-resources or the "requirements" resource job.
fr: Les fournisseurs souhaitant utiliser cette fonctionnalité doivent : 1- écrire une tâche qui place un fichier convenablement formaté dans $PLAINBOX_SESSION_SHARE 2- mettre à jour leur liste blanche pour exécuter cette tâche *avant* miscellanea/submission-resources ou la tâche de ressource « exigences ».

source: Generate an entry for each graphics card present in the system.
fr: Génère une entrée pour chaque carte graphique présente dans le système.

source: Resources to gather system information
fr: Ressources pour recueillir des informations du système
ru: Ресурсы для сбора информации о системе

source: Resources
fr: Ressources
ru: Ресурсы

source: Generate an entry for each FWTS test available
fr: Générer une entrée pour chaque test FWTS disponible

source: Generate an entry for each MIR integration tests
fr: Générer une entrée pour chaque test d'intégration de MIR

source: PlainBox resources provider
fr: Fournisseur de ressources de PlainBox
ru: Поставщик ресурсов PlainBox
